# Parameters
nc: 1  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple
anchors:
  - [4,3,  6,5,  7,6,  6,7,  7,9,  9,8] 
  - [5,3,  6,5,  7,5,  6,7,  8,7,  8,9]

# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [32, 3, 1]],
   [-1, 3, C3Reg, [64, 4]], 
   [-1, 3, C3Reg, [128, 8]],
   [-1, 5, C3Reg, [288, 18, 2]],
   [-1, 5, C3Reg, [672, 42]],
  ]

# YOLOv5 head
head:
  [
   [[2, 4], 1, Detect, [nc, anchors]],  # Detect
  ]
